CDMDEV1/src/InformationRegisters/ОчередьОбработкиДанных/ОчередьОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбработкиДанных</name>
  <resources>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПараметрыОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИнициации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбменДанных</name>
    <type>
      <types>CatalogRef.ОбменыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CDMDEV1/src/InformationRegisters/ОчередьОбработкиДанных/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Процедура ОбработататьСтрокуОчередиНаСервере(ИдентификаторыОбработчика)
	
	ОбработкаДанных.ОбработатьОчередь(ИдентификаторыОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработататьСтрокуОчереди(Команда) 
	
	ТекДанные = Элементы.Список.ТекущиеДанные; 
	Если ТекДанные.Обработано Тогда
		ПоказатьПредупреждение(,НСтр("ru='Повторно обработать можно только запись с ошибкой.'"),5);
		Возврат;
	КонецЕсли;     
	
	ОбработататьСтрокуОчередиНаСервере(Новый Структура("Идентификатор, ВремяИнициации, ИнформационнаяБаза", 
										ТекДанные.Идентификатор, ТекДанные.ВремяИнициации, ТекДанные.ИнформационнаяБаза));  

	Элементы.Список.Обновить();
	
КонецПроцедуры
